[
  {
    "id": "js121331224233",
    "date":"12-05-2024",
    "name": "Java script",
    "image": "https://t4.ftcdn.net/jpg/02/66/76/83/360_F_266768305_jxxjP3ivAYLHxbOejYQ4095SvaGfTjc3.jpg",
    "like": 100,
    "what": "JavaScript হলো একটি scripting অথবা programming language যা সাধারনত কোন ওয়েবসাইটে ব্যবহার করা হয়। এই language কে আবার client-side scripting language ও বলা হয় কারণ এর সোর্স কোড গুলো process হয় Client এর web browser দিয়ে।.....JavaScript language টি লিখতে হলে বা চালাতে হলে কোন  web server এর প্রয়োজন নেই।.....server-side scripting languages যেমন- PHP and ASP এর মতো আপনি JavaScript এর কোড সরাসরি আপনার ওয়েবপেজের HTML Code এ লিখতে পারবেন। তবে server-side scripting languages এর কোড লিখার পর আমরা যখন কোন Web Browser এ দেখি তখন তা একটি HTML আকারে দেখায় মানে আপনি যদি আপনার ওয়েবসাইটের Source Code দেখেন তাহলে শুধুমাত্র HTML কোড দেখতে পারবেন কিন্তু JavaScript এ্র ক্ষেত্রে একটু ভিন্ন মানে আপনি যা লিখেছিলেন তাই দেখতে পারবেন।....JavaScript এর প্রথমে নাম ছিল LiveScript যা কিনা ১৯৯৫ সালে তৈরী করা হয়েছিল কিন্তু পরবর্তীতে Netscape এই নামটি পরিবর্তন করে JavaScript রেখেছে।",
    "why": "JavaScript Engine কিভাবে কাজ করে তা বলতে গেলে অনেক কিছু বলা লাগবে তবে সাধারন ভাবে বলা যায় এভাবে....১। JavaScript Engine প্রথমে আপনার JavaScript Code পড়বে মানে parse করবে।.....২। তারপর আপনার JavaScript Code কে পরিবর্তন করে মানে compile করে একটি machine language এ নিয়ে আসবে।.....৩। তারপর এই machine language টিই আপনার কাজ করবে।"
  },
  {
    "id": "mongoose121331224233",
    "name": "Mongoose",
    "date":"11-05-2024",
    "image": "https://www.openlogic.com/sites/default/files/image/2021-06/image-blog-openlogic-what-is-mongodb.png",
    "like": 50,
    "what": "MongoDB ডাটাবেস হল একটি ক্রস-প্ল্যাটফর্ম, ওপেন সোর্স কোন SQL ডাটাবেস ম্যানেজমেন্ট সিস্টেম। এটি একটি নমনীয় এবং মাপযোগ্য উপায়ে প্রচুর পরিমাণে ডেটা সঞ্চয় এবং পরিচালনা করার জন্য ডিজাইন করা হয়েছে। MongoDB এর অন্যতম প্রধান বৈশিষ্ট্য হল এর নথি-ভিত্তিক ডেটা মডেল, যা ঐচ্ছিক স্কিমা সহ JSON- এর মতো নথি আকারে ডেটা সংরক্ষণ করে। এটি বৃহত্তর নমনীয়তা এবং দ্রুত বিকাশের সময়ের জন্য অনুমতি দেয়, কারণ ব্যয়বহুল ডেটা স্থানান্তরের প্রয়োজন ছাড়াই স্কিমাটি সহজেই পরিবর্তন করা যেতে পারে।......প্রযুক্তিগত বিবরণের পরিপ্রেক্ষিতে, MongoDB একটি বিতরণ করা আর্কিটেকচার ব্যবহার করে যেখানে ডেটা একাধিক সার্ভার বা শার্ড জুড়ে বিভাজন করা হয়। এটি অনুভূমিক স্কেলিং এর জন্য অনুমতি দেয়, যার অর্থ ডাটাবেস ক্রমবর্ধমান পরিমাণে ডেটা পরিচালনা করতে পারে এবং ব্যয়বহুল হার্ডওয়্যার আপগ্রেডের প্রয়োজন ছাড়াই কাজের চাপ পড়তে এবং লিখতে পারে। মঙ্গোডিবি উচ্চ প্রাপ্যতার জন্য বেশ কিছু অন্তর্নির্মিত বৈশিষ্ট্যও অন্তর্ভুক্ত করে, যেমন স্বয়ংক্রিয় ব্যর্থতা এবং প্রতিরূপ সেট। এটি নিশ্চিত করে যে হার্ডওয়্যার ব্যর্থতা বা অন্যান্য বাধার সময় ডাটাবেস উপলব্ধ এবং অ্যাক্সেসযোগ্য থাকে।.....মঙ্গোডিবি আধুনিক, ডেটা-চালিত অ্যাপ্লিকেশনগুলিতে প্রচুর পরিমাণে ডেটা সংরক্ষণ এবং পরিচালনা করার জন্য একটি শক্তিশালী এবং নমনীয় সরঞ্জাম। এর ডকুমেন্ট-ভিত্তিক ডেটা মডেল এবং বিতরণ করা আর্কিটেকচার এটিকে রিয়েল-টাইম অ্যানালিটিক্স এবং কন্টেন্ট ম্যানেজমেন্ট থেকে শুরু করে IoT এবং ই-কমার্স অ্যাপ্লিকেশন পর্যন্ত অনেক ব্যবহারের ক্ষেত্রে উপযুক্ত করে তোলে",
    "why": "MongoDB নথি আকারে ডেটা সংরক্ষণ করে কাজ করে, যা JSON অবজেক্টের মতো। এই নথিগুলি সংগ্রহে সংগঠিত হয়, একটি ঐতিহ্যগত রিলেশনাল ডাটাবেসের টেবিলের মতো। একটি সংগ্রহের প্রতিটি নথির একটি আলাদা কাঠামো থাকতে পারে, যা সংরক্ষণ করা যেতে পারে এমন ডেটা প্রকারগুলিতে বৃহত্তর নমনীয়তার অনুমতি দেয়। উদাহরণস্বরূপ, একটি নথিতে ব্যবহারকারীর নাম, ইমেল এবং ঠিকানা সহ তথ্য থাকতে পারে, অন্যটিতে একটি পণ্যের নাম, মূল্য এবং বিবরণ সহ তথ্য থাকতে পারে।..... MongoDB-তে ডেটা সঞ্চয় এবং পুনরুদ্ধার করতে, বিকাশকারীরা SQL এর মতো MongoDB ক্যোয়ারী ভাষা ব্যবহার করতে পারে। কোয়েরিগুলি একটি সংগ্রহের মধ্যে নির্দিষ্ট নথিগুলি অনুসন্ধান করতে, নথিগুলি আপডেট করতে বা মুছতে এবং অন্যান্য ডেটা পরিচালনার কাজগুলি সম্পাদন করতে ব্যবহার করা যেতে পারে।.....মঙ্গোডিবি কর্মক্ষমতা উন্নত করতে এবং উচ্চ প্রাপ্যতা নিশ্চিত করতে ইন্ডেক্সিং, শার্ডিং এবং ডেটা প্রতিলিপি করার জন্য বিভিন্ন অন্তর্নির্মিত বৈশিষ্ট্য অন্তর্ভুক্ত করে। সূচীগুলি একটি সংগ্রহের মধ্যে নির্দিষ্ট নথিগুলিকে দ্রুত সনাক্ত করতে ব্যবহার করা যেতে পারে, যখন শার্ডিং একাধিক সার্ভারে ডেটা বিভাজন করে অনুভূমিক স্কেলিং করার অনুমতি দেয়। অন্যদিকে, প্রতিলিপি একাধিক সার্ভার জুড়ে ডেটার কপি তৈরি করে যাতে ডেটা সর্বদা উপলব্ধ থাকে এবং ব্যর্থতার ক্ষেত্রে পুনরুদ্ধার করা যায়।"
  }
]
